{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (layout, theme, carousel, category tabs, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of every frontend source file, serving as a reference summary for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme tokens (background, foreground, primary, etc.).",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the JeetWin React app.",
  "frontend/src/App.tsx": "Root React component that composes Navigation, HeroCarousel, StatsBar, FeaturedGames, Promotions, WhyChooseUs, and Footer into a dark-themed full-page layout.",
  "frontend/src/components/CategoryTabs.tsx": "Horizontally scrollable tab bar component that renders category buttons from game data and highlights the active category with a gold style.",
  "frontend/src/components/FeaturedGames.tsx": "Games section component that combines CategoryTabs for filtering and renders a responsive grid of GameCard components based on the selected category.",
  "frontend/src/components/Footer.tsx": "Full-page footer with brand logo, social media icons, three link columns (Quick Links, Games, Support), payment method badges, and legal disclaimer.",
  "frontend/src/components/GameCard.tsx": "Individual game card displaying a game image with hover play overlay, badge labels (LIVE/JACKPOT/VIP/NEW/HOT), star rating, and a Play Now button.",
  "frontend/src/components/HeroCarousel.tsx": "A full-viewport hero carousel component with 5 slides covering casino, cricket, live casino, football, and bonus themes, featuring auto-play, navigation arrows, dot indicators, and animated text overlays.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with logo, smooth-scroll nav links, login/register buttons, a mobile hamburger menu, and a scrolling live ticker showing sports betting updates.",
  "frontend/src/components/PromoCard.tsx": "A card component that displays a single promotion with an image, highlight/category badges, title, description, and a CTA button.",
  "frontend/src/components/Promotions.tsx": "A section component that renders a grid of PromoCard components sourced from the promotions data file, with a section header and terms disclaimer.",
  "frontend/src/components/StatsBar.tsx": "A horizontal stats bar displaying four key platform metrics (active players, winnings paid, support availability, and security) with icons in a responsive grid.",
  "frontend/src/components/WhyChooseUs.tsx": "A section component showcasing six platform trust features (security, withdrawals, support, payments, odds, fair play) in a responsive card grid.",
  "frontend/src/data/footer.ts": "Static data arrays exporting quick links, game links, support links, and payment method names used to populate the site footer.",
  "frontend/src/data/games.ts": "Defines the Game interface and exports a list of six games with metadata (id, title, category, image, badges) and a categories array used for filtering.",
  "frontend/src/data/promotions.ts": "Defines the Promotion interface and exports three promotion objects (welcome bonus, referral, cashback) with display content and image paths.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using React Query, returning an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCarousel.ts": "A reusable carousel hook that manages current slide state, auto-play via an interval, and exposes next/prev/dot-click handlers that reset the auto-play timer.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useMobileMenu.ts": "Custom hook managing mobile menu open/close state with body scroll locking when the menu is open.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are needed for this static frontend application.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind directives, defining CSS custom properties for a dark gold/crimson casino theme, and utility component classes like gold-text, btn-gold, card-glow, and nav-link.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Oswald, Rajdhani, Inter), an oklch-based color system, and custom color palettes for gold, crimson, and dark shades along with typography and animation plugins.",
  "project_state.json": "Project state metadata describing the goal of recreating the JeetWin casino website with improved design, listing existing features, required AI-generated images, and architectural notes."
}