{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (entrance animations, WhatsApp redirect links) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of every frontend source file, describing each file's purpose and key implementation details.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom property tokens for light and dark themes used by shadcn-ui components.",
  "frontend/index.html": "Minimal HTML shell titled 'JeetWin' that mounts the React app at the #root div via the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root app component that composes all page sections (Navigation, HeroCarousel, StatsBar, FeaturedGames, Promotions, WhyChooseUs, Footer) and wraps each in an AnimatedSection helper that triggers viewport-based fade-in/slide-up entrance animations.",
  "frontend/src/components/CategoryTabs.tsx": "Horizontally scrollable sticky tab bar that renders game category buttons, highlighting the active category in gold with a bottom border indicator.",
  "frontend/src/components/FeaturedGames.tsx": "Featured games section that filters games by selected category, renders a staggered card reveal grid using IntersectionObserver, and wires the View All button to openWhatsApp.",
  "frontend/src/components/Footer.tsx": "Full-site footer with brand logo, social media icons, and three link columns (Quick Links, Games, Support) where every button and icon calls openWhatsApp instead of navigating internally.",
  "frontend/src/components/GameCard.tsx": "Game card component with hover scale/glow effects, badge overlays, and a star rating row; both the card click and the Play Now button redirect to WhatsApp via openWhatsApp.",
  "frontend/src/components/HeroCarousel.tsx": "A full-viewport hero carousel with 5 slides covering casino, cricket, live casino, football, and bonus themes, featuring auto-play, navigation controls, animated content overlays, and WhatsApp CTA buttons.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with logo, desktop nav links, login/register CTA buttons, a mobile hamburger menu, and a live ticker strip — all nav actions open WhatsApp.",
  "frontend/src/components/PromoCard.tsx": "A card component that displays a promotion's image, highlight badge, title, description, and a 'Claim Now' button that opens WhatsApp on click.",
  "frontend/src/components/Promotions.tsx": "A section that renders a responsive grid of PromoCard components from the promotions data, with a section header, viewport-triggered animations, and a terms disclaimer.",
  "frontend/src/components/StatsBar.tsx": "A horizontal stats bar displaying four platform metrics (active players, winnings paid, support availability, security) as clickable buttons that open WhatsApp.",
  "frontend/src/components/WhyChooseUs.tsx": "A section showcasing six platform features (security, withdrawals, support, payments, odds, fair play) in an animated grid of icon cards that open WhatsApp when clicked.",
  "frontend/src/constants/whatsapp.ts": "Exports a WhatsApp deep-link URL and a helper function `openWhatsApp` that opens it in a new tab.",
  "frontend/src/data/footer.ts": "Exports static arrays of quick links, game links, support links, and payment method names used to populate the site footer.",
  "frontend/src/data/games.ts": "Defines the `Game` interface and exports a list of six games with metadata (id, category, image, badges) plus a categories array used for filtering.",
  "frontend/src/data/promotions.ts": "Defines the `Promotion` interface and exports three promotions (welcome bonus, referral, cashback) with titles, descriptions, images, and highlight values.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCarousel.ts": "Custom React hook managing carousel state with auto-play, slide transitions, and navigation handlers (next, prev, dot click) with timer reset on manual interaction.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useMobileMenu.ts": "Custom hook managing mobile menu open/close state and locking body scroll when the menu is open.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module with no exports, indicating no backend queries are needed for this static frontend.",
  "frontend/src/hooks/useViewportAnimation.ts": "Custom hook using IntersectionObserver to track whether a referenced element is visible in the viewport, enabling scroll-triggered animations.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a dark casino-themed color system (gold, crimson, black) and reusable component classes like btn-gold, card-glow, and nav-link.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts (Oswald, Rajdhani, Inter), a gold/crimson/dark color palette, oklch-based semantic color tokens, and custom box shadows for the casino-style design.",
  "project_state.json": "Project state manifest tracking version, summary, architectural notes, known issues, and a list of implemented features for a JeetWin casino website clone with gold/crimson theming and WhatsApp CTA links."
}