{
  "kind": "build_request",
  "title": "Add animations and WhatsApp redirect on all interactive elements",
  "projectName": "JeetWin Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add entrance animations and micro-interactions throughout the entire website. This includes: fade-in/slide-up animations for sections as they enter the viewport (hero, stats bar, featured games, promotions, why choose us, footer), staggered card reveal animations for game cards and promo cards, hover scale/glow animations on all interactive cards and buttons, smooth transitions on the navigation bar, and animated text overlays in the hero carousel slides. Use CSS keyframes and/or Tailwind animation utilities consistently across all components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "add some animations",
          "Update the whole website accordingly"
        ]
      },
      "acceptanceCriteria": [
        "Sections fade-in and slide-up as they enter the viewport",
        "Game cards and promo cards have staggered reveal animations on load",
        "All interactive cards and buttons have hover scale and glow effects",
        "Navigation bar has smooth scroll and transition effects",
        "Hero carousel slides have animated text overlays"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Replace all link and button click handlers across the entire website so that every clickable element — including navigation links (Home, Sports, Casino, Promotions, About), Login button, Register button, Play Now buttons on game cards, Claim Now buttons on promo cards, footer quick links, footer game links, footer support links, social media icons, hero carousel CTA buttons, and stats bar items — opens the WhatsApp URL 'https://api.whatsapp.com/send?phone=917578900242&text=I%20want%20New%20Reddyanna%20%20Id%20!!!!!!!!!!!!!!' in a new tab. No internal routing or anchor navigation should remain; every interactive link/button must redirect to this WhatsApp URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "on every link click navigate to open whatsapp link \"https://api.whatsapp.com/send?phone=917578900242&text=I%20want%20New%20Reddyanna%20%20Id%20!!!!!!!!!!!!!!\""
        ]
      },
      "acceptanceCriteria": [
        "Clicking any navigation link (Home, Sports, Casino, Promotions, About) opens the WhatsApp URL in a new tab",
        "Clicking the Login button opens the WhatsApp URL in a new tab",
        "Clicking the Register button opens the WhatsApp URL in a new tab",
        "Clicking any Play Now button on game cards opens the WhatsApp URL in a new tab",
        "Clicking any Claim Now button on promo cards opens the WhatsApp URL in a new tab",
        "Clicking any footer link (quick links, game links, support links) opens the WhatsApp URL in a new tab",
        "Clicking any social media icon opens the WhatsApp URL in a new tab",
        "Clicking hero carousel CTA buttons opens the WhatsApp URL in a new tab",
        "Clicking stats bar items opens the WhatsApp URL in a new tab",
        "No internal routing or anchor navigation remains anywhere on the site"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "The WhatsApp URL must be exactly: https://api.whatsapp.com/send?phone=917578900242&text=I%20want%20New%20Reddyanna%20%20Id%20!!!!!!!!!!!!!!",
    "All WhatsApp links must open in a new browser tab"
  ],
  "nonGoals": [
    "Backend changes — the backend remains a placeholder with no functionality",
    "Adding new pages or routes",
    "Changing the existing color theme or layout structure",
    "Adding real authentication or user accounts"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}