{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add animations and WhatsApp redirect on all interactive elements",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add entrance animations and micro-interactions throughout the entire website including fade-in/slide-up viewport animations, staggered card reveals, hover effects, and smooth transitions",
      "acceptanceCriteria": [
        "Sections fade-in and slide-up as they enter the viewport",
        "Game cards and promo cards have staggered reveal animations on load",
        "All interactive cards and buttons have hover scale and glow effects",
        "Navigation bar has smooth scroll and transition effects",
        "Hero carousel slides have animated text overlays"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add CSS keyframe animations for fade-in, slide-up, scale, and glow effects. Define animation utility classes for viewport entrance animations, staggered reveals, and hover interactions. Add smooth transition utilities for navigation and carousel text overlays."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind animation configuration with custom keyframes for entrance animations (fadeInUp, staggerFadeIn) and interaction animations (scaleGlow). Add animation timing utilities for viewport-triggered and hover effects."
        },
        {
          "path": "frontend/src/hooks/useViewportAnimation.ts",
          "operation": "create",
          "description": "Create a custom React hook that uses Intersection Observer to detect when elements enter the viewport and triggers CSS animation classes. Return a ref and animation state that components can attach to trigger fade-in/slide-up animations."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Apply viewport animation hook to major sections (HeroCarousel, StatsBar, FeaturedGames, Promotions, WhyChooseUs, Footer) so each section animates in as it enters the viewport with fade-in and slide-up effects."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add smooth scroll behavior and transition effects to the navigation bar. Apply CSS transitions for background opacity changes on scroll, smooth hover transitions on nav links, and animated underline effects."
        },
        {
          "path": "frontend/src/components/HeroCarousel.tsx",
          "operation": "modify",
          "description": "Add animated text overlay effects to carousel slides using CSS keyframes. Apply fade-in and slide-up animations to headline and CTA elements with staggered timing for each slide transition."
        },
        {
          "path": "frontend/src/components/GameCard.tsx",
          "operation": "modify",
          "description": "Add hover scale and glow animations to game cards using CSS transforms and box-shadow transitions. Apply staggered reveal animation classes that trigger on mount, with each card animating in sequence based on its grid position."
        },
        {
          "path": "frontend/src/components/PromoCard.tsx",
          "operation": "modify",
          "description": "Add hover scale and glow animations to promo cards. Apply staggered reveal animation classes similar to GameCard so promo cards animate in sequence when the Promotions section enters the viewport."
        },
        {
          "path": "frontend/src/components/FeaturedGames.tsx",
          "operation": "modify",
          "description": "Integrate viewport animation hook to trigger staggered card reveal animations when the games section enters the viewport. Pass animation delay props to each GameCard based on its index to create the stagger effect."
        },
        {
          "path": "frontend/src/components/Promotions.tsx",
          "operation": "modify",
          "description": "Integrate viewport animation hook to trigger staggered card reveal animations when the promotions section enters the viewport. Pass animation delay props to each PromoCard based on its index."
        },
        {
          "path": "frontend/src/components/StatsBar.tsx",
          "operation": "modify",
          "description": "Add hover scale animations to stats bar items. Each stat item should have a subtle scale-up effect on hover with smooth transitions."
        },
        {
          "path": "frontend/src/components/WhyChooseUs.tsx",
          "operation": "modify",
          "description": "Add hover scale and glow animations to the feature cards. Apply staggered reveal animations when the section enters the viewport using the viewport animation hook."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add smooth hover transitions to footer links and social media icons, including color changes and subtle scale effects. Apply viewport animation to fade in the footer when it enters the viewport."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Replace all link and button click handlers across the entire website so every clickable element opens the WhatsApp URL in a new tab, removing all internal routing and anchor navigation",
      "acceptanceCriteria": [
        "Clicking any navigation link (Home, Sports, Casino, Promotions, About) opens the WhatsApp URL in a new tab",
        "Clicking the Login button opens the WhatsApp URL in a new tab",
        "Clicking the Register button opens the WhatsApp URL in a new tab",
        "Clicking any Play Now button on game cards opens the WhatsApp URL in a new tab",
        "Clicking any Claim Now button on promo cards opens the WhatsApp URL in a new tab",
        "Clicking any footer link (quick links, game links, support links) opens the WhatsApp URL in a new tab",
        "Clicking any social media icon opens the WhatsApp URL in a new tab",
        "Clicking hero carousel CTA buttons opens the WhatsApp URL in a new tab",
        "Clicking stats bar items opens the WhatsApp URL in a new tab",
        "No internal routing or anchor navigation remains anywhere on the site"
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/whatsapp.ts",
          "operation": "create",
          "description": "Create a constants file exporting the WhatsApp URL 'https://api.whatsapp.com/send?phone=917578900242&text=I%20want%20New%20Reddyanna%20%20Id%20!!!!!!!!!!!!!!' and a utility function openWhatsApp that opens this URL in a new tab using window.open with target='_blank' and rel='noopener noreferrer'."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Replace all navigation links (Home, Sports, Casino, Promotions, About) with button elements that call the openWhatsApp utility on click. Replace the Login and Register button click handlers to call openWhatsApp instead of any internal navigation. Remove all smooth-scroll anchor logic and href attributes."
        },
        {
          "path": "frontend/src/components/HeroCarousel.tsx",
          "operation": "modify",
          "description": "Replace all CTA button click handlers in carousel slides with calls to the openWhatsApp utility. Ensure all 'Play Now', 'Join Now', and similar buttons open the WhatsApp URL in a new tab."
        },
        {
          "path": "frontend/src/components/GameCard.tsx",
          "operation": "modify",
          "description": "Replace the 'Play Now' button click handler with a call to the openWhatsApp utility. Remove any internal routing or game launch logic."
        },
        {
          "path": "frontend/src/components/PromoCard.tsx",
          "operation": "modify",
          "description": "Replace the 'Claim Now' button click handler with a call to the openWhatsApp utility. Remove any internal routing or promotion detail logic."
        },
        {
          "path": "frontend/src/components/StatsBar.tsx",
          "operation": "modify",
          "description": "Wrap each stats bar item in a clickable button element that calls the openWhatsApp utility on click, ensuring all stats items redirect to WhatsApp when clicked."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace all footer links (Quick Links, Games, Support) with button elements that call the openWhatsApp utility on click. Replace social media icon links with buttons that call openWhatsApp. Remove all href attributes and anchor tags from the footer."
        }
      ]
    }
  ]
}